In [59]:
# DoL
topnames = {'year':[2018,2018,2017,2017,2016,2016],
           'sex':['Male','Female','Male','Female','Male','Female'],
           'name':['Liam','Emma','Liam','Emma','Noah','Emma'],
           'count':[19837,18688,18798,19800,19117,1996]}

In [60]:
topnames

{'year': [2018, 2018, 2017, 2017, 2016, 2016],
 'sex': ['Male', 'Female', 'Male', 'Female', 'Male', 'Female'],
 'name': ['Liam', 'Emma', 'Liam', 'Emma', 'Noah', 'Emma'],
 'count': [19837, 18688, 18798, 19800, 19117, 1996]}

In [61]:
topnames['year']

[2018, 2018, 2017, 2017, 2016, 2016]

In [62]:
[topnames['year'][3],topnames['sex'][3],topnames['name'][3],topnames['count'][3]]

[2017, 'Female', 'Emma', 19800]

In [69]:
mylist = []
for x in topnames.values():
    mylist.append(x[3])
    
mylist[0]

2017

In [40]:
# LoL
topnames = [[2018,'Male','Liam',19837],
           [2018,'Female','Emma',18688],
           [2017,'Male','Liam',18798],
           [2017,'Female','Emma',19800],
           [2016,'Male','Noah',19117],
           [2016,'Female','Emma',19496]]

In [35]:
topnames[3]

[2017, 'Female', 'Emma', 19800]

In [42]:
my_row = []
# return the year col
for i in range(len(topnames)):
    my_row.append(topnames[i][0])
my_row

[2018, 2018, 2017, 2017, 2016, 2016]

In [47]:
# work with pandas instead
import pandas as pd
# Pandas dataframe
df = pd.DataFrame(topnames,columns=['year','sex','name','count'])
df

   year     sex  name  count
0  2018    Male  Liam  19837
1  2018  Female  Emma  18688
2  2017    Male  Liam  18798
3  2017  Female  Emma  19800
4  2016    Male  Noah  19117
5  2016  Female  Emma  19496

In [49]:
# very easy to access cols
print(df.iloc[:,0]) # returns the year col using index location
print(df['year']) # likewise, but using col name

0    2018
1    2018
2    2017
3    2017
4    2016
5    2016
Name: year, dtype: int64
0    2018
1    2018
2    2017
3    2017
4    2016
5    2016
Name: year, dtype: int64

In [51]:
# very easy to access rows too!
df.iloc[3,:]

year       2017
sex      Female
name       Emma
count     19800
Name: 3, dtype: object

In [53]:
print(df.iloc[3,:][0]) # data in row 3 col 1
print(df['year'][3]) # same info

2017
2017

In [54]:
type(df) # df is a DataFrame object

pandas.core.frame.DataFrame

In [56]:
type(df['year']) # Pandas Series are arrays like in numpy

pandas.core.series.Series

In [58]:
df['year']*2 # broadcasting here works because pandas is built on numpy

0    4036
1    4036
2    4034
3    4034
4    4032
5    4032
Name: year, dtype: int64

In [3]:
import pandas as pd
# data about dogs, as DoL
DataDoL={'name':['Bella','Charlie','Lucy','Coooper','Max','Stella','Bernie'], 
 'breed':['Labrador','Poodle','ChowChow','Schnauzer','Labrador',
 'Chihuahua','St.Bernard'],
 'color': ['Brown','Black','Brown','Gray','Black','Tan','White'],
 'height_cm':[56,43,46,49,59,18,77],
 'weight_kg':[24,24,24,17,29,2,74],
 'date_of_birth':['2013-07-01','2016-09-16','2014-08-25',
 '2011-12-11','2017-01-28','2015-04-20',
 '2018-02-27']}

df = pd.DataFrame(DataDoL)
df

      name       breed  color  height_cm  weight_kg date_of_birth
0    Bella    Labrador  Brown         56         24    2013-07-01
1  Charlie      Poodle  Black         43         24    2016-09-16
2     Lucy    ChowChow  Brown         46         24    2014-08-25
3  Coooper   Schnauzer   Gray         49         17    2011-12-11
4      Max    Labrador  Black         59         29    2017-01-28
5   Stella   Chihuahua    Tan         18          2    2015-04-20
6   Bernie  St.Bernard  White         77         74    2018-02-27

In [5]:
df.info() # gives you bunch of useful info about your df object

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   name           7 non-null      object
 1   breed          7 non-null      object
 2   color          7 non-null      object
 3   height_cm      7 non-null      int64
 4   weight_kg      7 non-null      int64
 5   date_of_birth  7 non-null      object
dtypes: int64(2), object(4)
memory usage: 464.0+ bytes

In [6]:
df.describe() # bunch of useful stats to look at, also exist in R

       height_cm  weight_kg
count   7.000000   7.000000
mean   49.714286  27.714286
std    17.960274  22.216468
min    18.000000   2.000000
25%    44.500000  20.500000
50%    49.000000  24.000000
75%    57.500000  26.500000
max    77.000000  74.000000

In [12]:
# row index?
print(df.index) # returns the row index

# choosing cols
print(df['name'])
print(df.name) # equivalent to above. but only if your col name consists of characters excluding whitespace, dashes etc.
df.index = df.name

RangeIndex(start=0, stop=7, step=1)
0      Bella
1    Charlie
2       Lucy
3    Coooper
4        Max
5     Stella
6     Bernie
Name: name, dtype: object
0      Bella
1    Charlie
2       Lucy
3    Coooper
4        Max
5     Stella
6     Bernie
Name: name, dtype: object

In [17]:
print(df) # notice name col is a duplicate and redundant col now, so how to delete?
#del df['name'] # does the job but not recommended because it's not the pandas way of doing it
df = df.drop(columns=['name']) # use this syntax, it does not overwrite, so you'd need to assign to your df
print(df)

            name       breed  color  height_cm  weight_kg date_of_birth
name
Bella      Bella    Labrador  Brown         56         24    2013-07-01
Charlie  Charlie      Poodle  Black         43         24    2016-09-16
Lucy        Lucy    ChowChow  Brown         46         24    2014-08-25
Coooper  Coooper   Schnauzer   Gray         49         17    2011-12-11
Max          Max    Labrador  Black         59         29    2017-01-28
Stella    Stella   Chihuahua    Tan         18          2    2015-04-20
Bernie    Bernie  St.Bernard  White         77         74    2018-02-27
              breed  color  height_cm  weight_kg date_of_birth
name
Bella      Labrador  Brown         56         24    2013-07-01
Charlie      Poodle  Black         43         24    2016-09-16
Lucy       ChowChow  Brown         46         24    2014-08-25
Coooper   Schnauzer   Gray         49         17    2011-12-11
Max        Labrador  Black         59         29    2017-01-28
Stella    Chihuahua    Tan         18          2    2015-04-20
Bernie   St.Bernard  White         77         74    2018-02-27

In [ ]:
# accesing values in a df
# iloc method uses index location
# loc method can use string

In [20]:
df.loc['Bella'] # works because names are set up as row index

breed              Labrador
color                 Brown
height_cm                56
weight_kg                24
date_of_birth    2013-07-01
Name: Bella, dtype: object

In [21]:
df.shape # returns that our df has 7 rows and 5 cols

(7, 5)

In [31]:
# filtering data, 
print(df[df.height_cm>50]) # filtering based on a numeric column
# in R: df[df$height_cm>50], dplyr: df %>% filter(height_cm>50)
print(df[df.date_of_birth>'2015-01-01'])# filtering based on a date, 2015-01-01

             breed  color  height_cm  weight_kg date_of_birth
name
Bella     Labrador  Brown         56         24    2013-07-01
Max       Labrador  Black         59         29    2017-01-28
Bernie  St.Bernard  White         77         74    2018-02-27
              breed  color  height_cm  weight_kg date_of_birth
name
Charlie      Poodle  Black         43         24    2016-09-16
Max        Labrador  Black         59         29    2017-01-28
Stella    Chihuahua    Tan         18          2    2015-04-20
Bernie   St.Bernard  White         77         74    2018-02-27

In [ ]:
# btw, is date_of_birth col string?
print(type(df.date_of_birth[0])) # it is string

# selecting cols
print(df.breed) # or
#df['breed']
# in R df$name or in dpylr: df %>% select(name)

In [32]:
df

              breed  color  height_cm  weight_kg date_of_birth
name
Bella      Labrador  Brown         56         24    2013-07-01
Charlie      Poodle  Black         43         24    2016-09-16
Lucy       ChowChow  Brown         46         24    2014-08-25
Coooper   Schnauzer   Gray         49         17    2011-12-11
Max        Labrador  Black         59         29    2017-01-28
Stella    Chihuahua    Tan         18          2    2015-04-20
Bernie   St.Bernard  White         77         74    2018-02-27

In [68]:
# how would you get the age of each dog?
# you want to subtract each date_of_birth from today's date: 2024-09-27
import datetime as dt
import numpy as np
df['date_of_birth'] = pd.to_datetime(df.date_of_birth) # convert string date col into a datetime col via pandas
#dt.date.today() - df['date_of_birth'] # won't work
# instead, create a new col consisting of the date threshold
df['current_date'] = pd.to_datetime(dt.date.today())
df['age'] = np.round((df['current_date'] - df['date_of_birth']).dt.days/365 , 2)
df

,breed,color,height_cm,weight_kg,date_of_birth,current_date,age
name,,,,,,,
Bella,Labrador,Brown,56,24,2013-07-01,2024-09-27,11.25
Charlie,Poodle,Black,43,24,2016-09-16,2024-09-27,8.04
Lucy,ChowChow,Brown,46,24,2014-08-25,2024-09-27,10.10
Coooper,Schnauzer,Gray,49,17,2011-12-11,2024-09-27,12.81
Max,Labrador,Black,59,29,2017-01-28,2024-09-27,7.67
Stella,Chihuahua,Tan,18,2,2015-04-20,2024-09-27,9.45
Bernie,St.Bernard,White,77,74,2018-02-27,2024-09-27,6.59

In [58]:
df

              breed  color  height_cm  weight_kg date_of_birth current_date
name
Bella      Labrador  Brown         56         24    2013-07-01   2024-09-27
Charlie      Poodle  Black         43         24    2016-09-16   2024-09-27
Lucy       ChowChow  Brown         46         24    2014-08-25   2024-09-27
Coooper   Schnauzer   Gray         49         17    2011-12-11   2024-09-27
Max        Labrador  Black         59         29    2017-01-28   2024-09-27
Stella    Chihuahua    Tan         18          2    2015-04-20   2024-09-27
Bernie   St.Bernard  White         77         74    2018-02-27   2024-09-27

In [59]:
df['current_date']

name
Bella     2024-09-27
Charlie   2024-09-27
Lucy      2024-09-27
Coooper   2024-09-27
Max       2024-09-27
Stella    2024-09-27
Bernie    2024-09-27
Name: current_date, dtype: datetime64[ns]

In [75]:
# if you want to import a csv file into pandas
#topnames = pd.read_csv(r"C:\Users\bilene\Downloads\topnames.csv") # or
topnames = pd.read_csv(r"https://raw.githubusercontent.com/ernbilen/Data200_Fall24/refs/heads/main/data/topnames.csv")
topnames

     year     sex  name  count
0    1880  Female  Mary   7065
1    1880    Male  John   9655
2    1881  Female  Mary   6919
3    1881    Male  John   8769
4    1882  Female  Mary   8148
..    ...     ...   ...    ...
273  2016    Male  Noah  19117
274  2017  Female  Emma  19800
275  2017    Male  Liam  18798
276  2018  Female  Emma  18688
277  2018    Male  Liam  19837

[278 rows x 4 columns]

In [74]:
topnames.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 278 entries, 0 to 277
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   year    278 non-null    int64
 1   sex     278 non-null    object
 2   name    278 non-null    object
 3   count   278 non-null    int64
dtypes: int64(2), object(2)
memory usage: 8.8+ KB